results_emmy/node_exporter/results/parallel_wrk/output_4.txt
--------------------------------------------------------
Running benchmark with 1 threads and 1 connections for 60s
Running 1m test @ http://localhost:24343
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    39.64us   14.04us   1.57ms   95.70%
    Req/Sec    24.27k     2.72k   29.07k    59.07%
  1451630 requests in 1.00m, 1.46GB read
Requests/sec:  24153.78
Transfer/sec:     24.83MB
--------------------------------------------------------
Running benchmark with 1 threads and 10 connections for 60s
Running 1m test @ http://localhost:24343
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   111.72us  503.62us  32.83ms   99.73%
    Req/Sec    79.73k     2.14k   89.73k    94.34%
  4767775 requests in 1.00m, 4.79GB read
Requests/sec:  79330.34
Transfer/sec:     81.56MB
--------------------------------------------------------
Running benchmark with 2 threads and 10 connections for 60s
Running 1m test @ http://localhost:24343
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    85.72us   81.71us   2.32ms   93.54%
    Req/Sec    62.79k     1.47k   67.95k    73.21%
  7510020 requests in 1.00m, 7.54GB read
Requests/sec: 124960.36
Transfer/sec:    128.47MB
--------------------------------------------------------
Running benchmark with 4 threads and 10 connections for 60s
Running 1m test @ http://localhost:24343
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    70.88us  111.53us  12.55ms   96.17%
    Req/Sec    30.45k   622.21    33.51k    76.96%
  7285080 requests in 1.00m, 7.31GB read
Requests/sec: 121216.33
Transfer/sec:    124.62MB
--------------------------------------------------------
Running benchmark with 8 threads and 10 connections for 60s
Running 1m test @ http://localhost:24343
  8 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    69.79us   60.46us   1.71ms   94.70%
    Req/Sec    15.28k   576.75    17.65k    71.82%
  7309604 requests in 1.00m, 7.34GB read
Requests/sec: 121624.45
Transfer/sec:    125.04MB
--------------------------------------------------------
Running benchmark with 1 threads and 25 connections for 60s
Running 1m test @ http://localhost:24343
  1 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   190.43us  110.72us   2.19ms   88.61%
    Req/Sec    80.77k   682.94    82.69k    66.89%
  4829692 requests in 1.00m, 4.85GB read
Requests/sec:  80360.74
Transfer/sec:     82.62MB
--------------------------------------------------------
Running benchmark with 2 threads and 25 connections for 60s
Running 1m test @ http://localhost:24343
  2 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   192.48us  162.98us   2.19ms   89.79%
    Req/Sec    67.17k     1.80k   78.57k    77.20%
  8034513 requests in 1.00m, 8.07GB read
Requests/sec: 133686.61
Transfer/sec:    137.44MB
--------------------------------------------------------
Running benchmark with 4 threads and 25 connections for 60s
Running 1m test @ http://localhost:24343
  4 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   199.21us  168.38us   2.46ms   89.19%
    Req/Sec    33.11k     0.99k   39.77k    74.13%
  7921244 requests in 1.00m, 7.95GB read
Requests/sec: 131801.45
Transfer/sec:    135.50MB
--------------------------------------------------------
Running benchmark with 8 threads and 25 connections for 60s
Running 1m test @ http://localhost:24343
  8 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   183.96us  157.11us   7.78ms   89.33%
    Req/Sec    17.87k     1.50k   21.64k    62.58%
  8550865 requests in 1.00m, 8.58GB read
Requests/sec: 142278.63
Transfer/sec:    146.27MB
--------------------------------------------------------
Running benchmark with 16 threads and 25 connections for 60s
Running 1m test @ http://localhost:24343
  16 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   115.31us   92.62us   2.21ms   90.24%
    Req/Sec     8.98k   705.39    10.82k    61.35%
  8589253 requests in 1.00m, 8.62GB read
Requests/sec: 142915.55
Transfer/sec:    146.93MB
--------------------------------------------------------
Running benchmark with 1 threads and 50 connections for 60s
Running 1m test @ http://localhost:24343
  1 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   337.87us  139.65us   2.50ms   89.01%
    Req/Sec    82.20k   616.70    83.82k    70.55%
  4916250 requests in 1.00m, 4.94GB read
Requests/sec:  81799.94
Transfer/sec:     84.10MB
--------------------------------------------------------
Running benchmark with 2 threads and 50 connections for 60s
Running 1m test @ http://localhost:24343
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   395.79us  315.58us   3.34ms   78.59%
    Req/Sec    68.37k     2.81k   99.06k    84.86%
  8176293 requests in 1.00m, 8.21GB read
Requests/sec: 136044.08
Transfer/sec:    139.86MB
--------------------------------------------------------
Running benchmark with 4 threads and 50 connections for 60s
Running 1m test @ http://localhost:24343
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   385.05us  309.50us   3.30ms   76.85%
    Req/Sec    34.18k     1.21k   40.29k    70.88%
  8174948 requests in 1.00m, 8.21GB read
Requests/sec: 136020.46
Transfer/sec:    139.84MB
--------------------------------------------------------
Running benchmark with 8 threads and 50 connections for 60s
Running 1m test @ http://localhost:24343
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   373.90us  296.69us   3.09ms   75.24%
    Req/Sec    17.56k   789.56    20.88k    70.92%
  8400188 requests in 1.00m, 8.43GB read
Requests/sec: 139771.92
Transfer/sec:    143.69MB
--------------------------------------------------------
Running benchmark with 16 threads and 50 connections for 60s
Running 1m test @ http://localhost:24343
  16 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   353.25us  278.03us   3.09ms   74.57%
    Req/Sec     9.26k   718.65    10.98k    59.20%
  8860489 requests in 1.00m, 8.90GB read
Requests/sec: 147430.63
Transfer/sec:    151.57MB
--------------------------------------------------------
Running benchmark with 1 threads and 100 connections for 60s
Running 1m test @ http://localhost:24343
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   641.38us  219.37us   5.05ms   89.95%
    Req/Sec    84.23k     1.81k   90.24k    84.50%
  5029156 requests in 1.00m, 5.05GB read
Requests/sec:  83814.37
Transfer/sec:     86.17MB
--------------------------------------------------------
Running benchmark with 2 threads and 100 connections for 60s
Running 1m test @ http://localhost:24343
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   785.45us  604.01us   5.72ms   71.79%
    Req/Sec    68.50k     2.04k   81.13k    75.02%
  8185700 requests in 1.00m, 8.22GB read
Requests/sec: 136199.31
Transfer/sec:    140.02MB
--------------------------------------------------------
Running benchmark with 4 threads and 100 connections for 60s
Running 1m test @ http://localhost:24343
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   794.82us  616.62us   6.48ms   69.81%
    Req/Sec    34.47k     1.11k   40.86k    74.58%
  8245396 requests in 1.00m, 8.28GB read
Requests/sec: 137193.18
Transfer/sec:    141.04MB
--------------------------------------------------------
Running benchmark with 8 threads and 100 connections for 60s
Running 1m test @ http://localhost:24343
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   735.53us  577.04us  12.81ms   70.43%
    Req/Sec    17.78k     0.99k   20.93k    74.06%
  8506532 requests in 1.00m, 8.54GB read
Requests/sec: 141537.24
Transfer/sec:    145.51MB
--------------------------------------------------------
Running benchmark with 16 threads and 100 connections for 60s
Running 1m test @ http://localhost:24343
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   702.12us  544.85us   5.64ms   69.74%
    Req/Sec     9.29k   696.70    10.90k    58.23%
  8891578 requests in 1.00m, 8.93GB read
Requests/sec: 147945.02
Transfer/sec:    152.10MB
--------------------------------------------------------
Running benchmark with 1 threads and 150 connections for 60s
Running 1m test @ http://localhost:24343
  1 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.96ms  351.04us   5.21ms   88.40%
    Req/Sec    85.04k     4.13k  100.92k    91.83%
  5076029 requests in 1.00m, 5.10GB read
Requests/sec:  84596.26
Transfer/sec:     86.97MB
--------------------------------------------------------
Running benchmark with 2 threads and 150 connections for 60s
Running 1m test @ http://localhost:24343
  2 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.18ms    0.90ms   8.38ms   69.77%
    Req/Sec    68.64k     1.70k   76.36k    74.71%
  8207624 requests in 1.00m, 8.24GB read
Requests/sec: 136561.01
Transfer/sec:    140.39MB
--------------------------------------------------------
Running benchmark with 4 threads and 150 connections for 60s
Running 1m test @ http://localhost:24343
  4 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.19ms    0.92ms   8.51ms   68.80%
    Req/Sec    34.11k     0.89k   38.65k    67.17%
  8145985 requests in 1.00m, 8.18GB read
Requests/sec: 135764.57
Transfer/sec:    139.57MB
--------------------------------------------------------
Running benchmark with 8 threads and 150 connections for 60s
Running 1m test @ http://localhost:24343
  8 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms    0.88ms   8.26ms   69.03%
    Req/Sec    17.50k   757.98    20.34k    72.80%
  8373385 requests in 1.00m, 8.41GB read
Requests/sec: 139323.88
Transfer/sec:    143.23MB
--------------------------------------------------------
Running benchmark with 16 threads and 150 connections for 60s
Running 1m test @ http://localhost:24343
  16 threads and 150 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms  797.32us   7.85ms   68.78%
    Req/Sec     9.54k   610.88    10.95k    64.78%
  9123816 requests in 1.00m, 9.16GB read
Requests/sec: 151810.27
Transfer/sec:    156.07MB
--------------------------------------------------------
Running benchmark with 1 threads and 200 connections for 60s
Running 1m test @ http://localhost:24343
  1 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.29ms  383.99us   6.67ms   87.20%
    Req/Sec    82.18k     4.40k  115.67k    95.99%
  4904672 requests in 1.00m, 4.92GB read
Requests/sec:  81732.20
Transfer/sec:     84.03MB
--------------------------------------------------------
Running benchmark with 2 threads and 200 connections for 60s
Running 1m test @ http://localhost:24343
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.58ms    1.17ms  11.83ms   67.53%
    Req/Sec    67.60k     1.95k   77.62k    80.00%
  8072007 requests in 1.00m, 8.10GB read
Requests/sec: 134528.79
Transfer/sec:    138.30MB
--------------------------------------------------------
Running benchmark with 4 threads and 200 connections for 60s
Running 1m test @ http://localhost:24343
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.58ms    1.16ms  10.26ms   66.82%
    Req/Sec    34.01k     0.99k   38.74k    70.42%
  8134472 requests in 1.00m, 8.17GB read
Requests/sec: 135345.53
Transfer/sec:    139.14MB
--------------------------------------------------------
Running benchmark with 8 threads and 200 connections for 60s
Running 1m test @ http://localhost:24343
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.49ms    1.09ms  11.43ms   66.78%
    Req/Sec    18.05k     1.14k   21.10k    67.11%
  8631908 requests in 1.00m, 8.67GB read
Requests/sec: 143625.11
Transfer/sec:    147.66MB
--------------------------------------------------------
Running benchmark with 16 threads and 200 connections for 60s
Running 1m test @ http://localhost:24343
  16 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.36ms    1.01ms  10.16ms   67.20%
    Req/Sec     9.49k   620.68    12.32k    64.09%
  9080796 requests in 1.00m, 9.12GB read
Requests/sec: 151095.56
Transfer/sec:    155.34MB
--------------------------------------------------------
Running benchmark with 1 threads and 300 connections for 60s
Running 1m test @ http://localhost:24343
  1 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.82ms  581.94us   8.71ms   86.11%
    Req/Sec    87.89k     8.54k  115.67k    88.80%
  5249043 requests in 1.00m, 5.27GB read
Requests/sec:  87422.13
Transfer/sec:     89.88MB
--------------------------------------------------------
Running benchmark with 2 threads and 300 connections for 60s
Running 1m test @ http://localhost:24343
  2 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.25ms    1.46ms  14.01ms   65.32%
    Req/Sec    68.64k     2.37k   79.53k    69.75%
  8195366 requests in 1.00m, 8.23GB read
Requests/sec: 136557.65
Transfer/sec:    140.39MB
--------------------------------------------------------
Running benchmark with 4 threads and 300 connections for 60s
Running 1m test @ http://localhost:24343
  4 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.26ms    1.45ms  14.83ms   64.99%
    Req/Sec    34.40k     1.57k   42.12k    74.75%
  8216439 requests in 1.00m, 8.25GB read
Requests/sec: 136877.76
Transfer/sec:    140.72MB
--------------------------------------------------------
Running benchmark with 8 threads and 300 connections for 60s
Running 1m test @ http://localhost:24343
  8 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.20ms    1.44ms  16.72ms   65.38%
    Req/Sec    17.44k     1.63k   38.51k    73.54%
  8336637 requests in 1.00m, 8.37GB read
Requests/sec: 138713.35
Transfer/sec:    142.61MB
--------------------------------------------------------
Running benchmark with 16 threads and 300 connections for 60s
Running 1m test @ http://localhost:24343
  16 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.99ms    1.31ms  13.84ms   64.95%
    Req/Sec     9.34k   753.88    13.39k    64.13%
  8935570 requests in 1.00m, 8.97GB read
Requests/sec: 148677.26
Transfer/sec:    152.85MB
--------------------------------------------------------
Running benchmark with 1 threads and 400 connections for 60s
Running 1m test @ http://localhost:24343
  1 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.52ms  677.84us   9.96ms   87.69%
    Req/Sec    83.14k     2.17k   88.99k    75.67%
  4966239 requests in 1.00m, 4.99GB read
Requests/sec:  82708.16
Transfer/sec:     85.03MB
--------------------------------------------------------
Running benchmark with 2 threads and 400 connections for 60s
Running 1m test @ http://localhost:24343
  2 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.95ms    1.64ms  14.83ms   67.48%
    Req/Sec    68.71k     2.18k   81.14k    72.92%
  8203040 requests in 1.00m, 8.24GB read
Requests/sec: 136673.38
Transfer/sec:    140.51MB
--------------------------------------------------------
Running benchmark with 4 threads and 400 connections for 60s
Running 1m test @ http://localhost:24343
  4 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.98ms    1.64ms  16.56ms   67.47%
    Req/Sec    34.29k     1.05k   38.15k    70.38%
  8188321 requests in 1.00m, 8.22GB read
Requests/sec: 136438.88
Transfer/sec:    140.27MB
--------------------------------------------------------
Running benchmark with 8 threads and 400 connections for 60s
Running 1m test @ http://localhost:24343
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.03ms    1.69ms  16.29ms   67.66%
    Req/Sec    16.86k     1.04k   71.42k    88.69%
  8052238 requests in 1.00m, 8.08GB read
Requests/sec: 133979.73
Transfer/sec:    137.74MB
--------------------------------------------------------
Running benchmark with 16 threads and 400 connections for 60s
Running 1m test @ http://localhost:24343
  16 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.67ms    1.47ms  14.80ms   67.22%
    Req/Sec     9.53k     0.85k   16.64k    62.94%
  9115747 requests in 1.00m, 9.15GB read
Requests/sec: 151676.23
Transfer/sec:    155.93MB
--------------------------------------------------------
Running benchmark with 1 threads and 500 connections for 60s
Running 1m test @ http://localhost:24343
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.18ms  847.40us  12.52ms   87.14%
    Req/Sec    82.42k     1.06k   88.69k    84.18%
  4920167 requests in 1.00m, 4.94GB read
Requests/sec:  81971.61
Transfer/sec:     84.27MB
--------------------------------------------------------
Running benchmark with 2 threads and 500 connections for 60s
Running 1m test @ http://localhost:24343
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.77ms    1.83ms  19.03ms   69.32%
    Req/Sec    66.99k     1.55k   75.94k    74.67%
  7998547 requests in 1.00m, 8.03GB read
Requests/sec: 133271.86
Transfer/sec:    137.01MB
--------------------------------------------------------
Running benchmark with 4 threads and 500 connections for 60s
Running 1m test @ http://localhost:24343
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.78ms    1.82ms  19.04ms   69.27%
    Req/Sec    33.51k     1.07k   40.28k    79.21%
  8001332 requests in 1.00m, 8.03GB read
Requests/sec: 133312.01
Transfer/sec:    137.05MB
--------------------------------------------------------
Running benchmark with 8 threads and 500 connections for 60s
Running 1m test @ http://localhost:24343
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.59ms    1.75ms  20.34ms   69.32%
    Req/Sec    17.48k     1.42k   20.79k    62.06%
  8347520 requests in 1.00m, 8.38GB read
Requests/sec: 139102.35
Transfer/sec:    143.01MB
--------------------------------------------------------
Running benchmark with 16 threads and 500 connections for 60s
Running 1m test @ http://localhost:24343
  16 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.42ms    1.62ms  16.42ms   68.47%
    Req/Sec     9.17k   663.76    18.67k    68.62%
  8768477 requests in 1.00m, 8.80GB read
Requests/sec: 145898.22
Transfer/sec:    149.99MB